sa-patel/249-Soda_HALL/nrf/nrf52x-base/apps/ble/ble_service/main.c
// Blink app
//
// Blinks an LED

#include <stdbool.h>
#include <stdint.h>
#include "nrf.h"
#include "app_util.h"
#include "simple_ble.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"

// Pin definitions
#define LED NRF_GPIO_PIN_MAP(0,17)

// Intervals for advertising and connections
static simple_ble_config_t ble_config = {
        // c0:98:e5:45:xx:xx
        .platform_id       = 0x42,    // used as 4th octect in device BLE address
        .device_id         = 0xAABB,
        .adv_name          = "LAB11", // used in advertisements if there is room
        .adv_interval      = MSEC_TO_UNITS(1000, UNIT_0_625_MS),
        .min_conn_interval = MSEC_TO_UNITS(500, UNIT_1_25_MS),
        .max_conn_interval = MSEC_TO_UNITS(1000, UNIT_1_25_MS),
};

static simple_ble_service_t led_service = {{
    .uuid128 = {0x70,0x6C,0x98,0x41,0xCE,0x43,0x14,0xA9,
                0xB5,0x4D,0x22,0x2B,0x89,0x10,0xE6,0x32}
}};

static simple_ble_char_t led_state_char = {.uuid16 = 0x8912};
static simple_ble_char_t led1_state_char = {.uuid16 = 0x8911};
static bool led_state = false;

/*******************************************************************************
 *   State for this application
 ******************************************************************************/
// Main application state
simple_ble_app_t* simple_ble_app;

void ble_evt_write(ble_evt_t const* p_ble_evt) {
    if (simple_ble_is_char_event(p_ble_evt, &led_state_char)) {
      printf("Got write to LED characteristic!\n");
      if (led_state) {
        printf("Turning on LED!\n");
        nrf_gpio_pin_clear(LED);
      } else {
        printf("Turning off LED!\n");
        nrf_gpio_pin_set(LED);
      }
    }

    if (simple_ble_is_char_event(p_ble_evt, &led1_state_char)) {
      printf("Got write to LED characteristic!\n");
      if (led_state) {
        printf("Turning on LED!\n");
        nrf_gpio_pin_clear(LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_set(LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_clear(LED);
      } else {
        printf("Turning off LED!\n");
        nrf_gpio_pin_set(LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_clear(LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_set(LED);
      }
    }
}

int main(void) {

  // Initialize

  // Setup LED GPIO
  nrf_gpio_cfg_output(LED);

  // Setup BLE
  simple_ble_app = simple_ble_init(&ble_config);

  simple_ble_add_service(&led_service);

  //simple_ble_add_characteristic(1, 1, 0, 0,
  //    sizeof(led_state), (uint8_t*)&led_state,
  //    &led_service, &led_state_char);

  simple_ble_add_characteristic(1, 1, 0, 0,
        sizeof(led_state), (uint8_t*)&led_state,
        &led_service, &led1_state_char);

  // Start Advertising
  simple_ble_adv_only_name();
  ble_gap_addr_t ble_addr;
  sd_ble_gap_address_get(&ble_addr);
  printf("Address: %d", ble_addr);
  while(1) {
    power_manage();
    //printf("Address: %d \n", ble_addr);
    //nrf_delay_ms(500);
    
  }
}

